test-artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 7
      name: Warm up

scenarios:
  - name: "login read create update delete"
    flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            json: "$.token"
            as: "token"
      - get:
          url: "/users"
          headers: 
            authorization: "Bearer {{token}}"
      - post: 
          url: "/users"
          json:
            name: "test"
            login: "test"
            password: "test"
          headers: 
            authorization: "Bearer {{token}}"
          capture:
            json: "$.id"
            as: "id"
      - put:
          url: "/users/{{id}}"
          json:
            name: "test1"
            login: "test1"
            password: "1"
          headers: 
            authorization: "Bearer {{token}}"
      - delete:
          url: "/users/{{id}}"
          headers:
            authorization: "Bearer {{token}}"